# Случайная непрерывная величина A имеет равномерное распределение на
# промежутке (200, 800].
# Найдите ее среднее значение и дисперсию.

a = 200
b = 800
MA = a + b / 2
print('Cреднее значение M(A) = ', MA)

D = ((b - a) ** 2) / 12
print('Дисперсия D = ', D)
